{
    "sessions": [
        {
            "speaker": "Rex Black",
            "shortbio": "Author & QA Architect at Epic Games",
            "bio": "With a quarter-century of software and systems engineering experience, Rex Black is a leader in software, hardware, and systems testing. Rex is the most prolific author practicing in the field of software testing today. His popular first book, Managing the Testing Process, has sold over 40,000 copies around the world, including Japanese, Chinese, and Indian releases, and is now in its third edition. He has written over 30 articles, presented hundreds of papers, workshops, and seminars, and given about 50 keynotes and other speeches at conferences and events around the world. Rex is the immediate past President of the International Software Testing Qualifications Board and of the American Software Testing Qualifications Board.",
            "title": "** Coming Soon **",
            "abstract": "** Coming Soon **",
            "summary": "** Coming Soon **",
            "time": "8:00 - 9:00",
            "room": "East Ballroom",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/rex-black/",
            "twitter": "https://twitter.com/RBCS",
            "youtube": ""
        },
        {
            "speaker": "Tariq King",
            "shortbio": "CEO at Test IO",
            "bio": "Tariq King is a recognized thought-leader in software testing and  quality engineering. He is currently the CEO and Head of Test IO, an EPAM company. Tariq has over fifteen years' professional experience in the software industry, and has formerly held positions including VP of Product-Services, Chief Scientist, Head of Quality, Quality Engineering Director, Software Engineering Manager, and Principal Architect. He holds Ph.D. and M.S. degrees in Computer Science from Florida International University, and a B.S. in Computer Science from Florida Tech. He has published over 40 research articles in peer-reviewed IEEE and ACM journals, conferences, and workshops, and has written book chapters and technical reports for Springer, O'Reilly, IGI Global, and more. Tariq has been an international keynote speaker and trainer at leading software conferences in industry and academia, and serves on multiple conference boards and program committees.",
            "title": "** Coming Soon **",
            "abstract": "** Coming Soon **",
            "summary": "** Coming Soon **",
            "time": "4:15 - 5:15",
            "room": "East Ballroom",
            "website": "https://medium.com/@tariq_king",
            "linkedin": "https://www.linkedin.com/in/tariqking",
            "twitter": "https://x.com/@tariq_king",
            "slidesLink": "",
            "speaker2": "",
            "bio2": "",
            "shortbio2": "",
            "linkedin2": "",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        }
    ],
    "potential": [
        {
            "speaker": "",
            "bio": "",
            "shortbio": "",
            "title": "",
            "summary": "",
            "abstract": "",
            "time": "4:15 - 5:15",
            "room": "East Ballroom",
            "picture": "",
            "website": "",
            "linkedin": "",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "",
            "bio": "",
            "shortbio": "",
            "title": "",
            "summary": "",
            "abstract": "",
            "time": "",
            "room": "",
            "picture": "",
            "website": "",
            "linkedin": "",
            "twitter": "",
            "youtube": "",
            "speaker2": "",
            "bio2": "",
            "shortbio2": "",
            "linkedin2": "",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        }
    ]
}
        