{
    "sessions": [
        {
            "speaker": "Joe Colantonio",
            "bio": "Joe is the founder of TestGuild.com, a blog, podcast, and online conference dedicated to helping testers and their organizations to succeed. Joe is a prominent voice in the community with his podcast where he helps other people share their testing experiences and insights. Joe also runs many of the online conferences behind the scenes.\n\nJoe has over 20 years of hands-on experience developing and implementing numerous software automation and performance testing solutions, using both vendor-based and open source technologies.",
            "title": "** Session Title Coming **",
            "abstract": "** We'll be posting the session abstract shortly. Please check back later **",
            "time": "8:00 - 9:00",
            "room": "East Ballroom",
            "picture": "",
            "website": "https://testguild.com/",
            "linkedin": "https://www.linkedin.com/in/joecolantonio/",
            "twitter": "https://twitter.com/testguilds",
            "youtube": "https://www.youtube.com/@JoeColantonio"
        },
        {
            "speaker": "Raj Subrameyer",
            "bio": "Raj Subrameyer is a Senior QA Manager and Certified Tech Career and Leadership Coach helping people to land their dream job and become successful leaders. He is passionate about guiding professionals to maximize their opportunities and discover their zone of genius. He has given multiple TEDx talks and is a sought-after speaker at various conferences and has been featured in numerous TV news segments, podcasts and publications, including CBS, BBC, FOX, NPR, NBC, Entrepreneur, CEOWorld Magazine, CIO and Authority Magazine, Career Addict, Thrive Global, Addicted2Success and The Good Men Project. His areas of expertise include career advancement, leadership, motivation, productivity, mental health, diversity & inclusion and entrepreneurship. In his spare time, he loves traveling and enjoying craft beer.",
            "title": "** Session Title Coming **",
            "abstract": "** We'll be posting the session abstract shortly. Please check back later **",
            "time": "4:15 - 5:15",
            "room": "East Ballroom",
            "picture": "",
            "website": "https://www.rajsubra.com/",
            "linkedin": "https://www.linkedin.com/in/rajsubra/",
            "twitter": "https://twitter.com/epsilon11",
            "youtube": "https://www.youtube.com/c/chailatteconsulting"
        },
        {
            "speaker": "Andy Warns",
            "speaker2": "Jacob Haning",
            "bio": "Andy Warns is the Principal Automation Architect at Impower.ai. A subject matter expert in process and test automation, continuous integration/delivery, and enterprise architecture, he focuses on partnering with leadership to strategize, architect and implement automation solutions with the goal of driving efficiency gains throughout the entire organization.",
            "bio2": "Jacob Haning is the Principal AI Architect at Impower.ai. A subject matter expert in machine learning, Artificial Intelligence (AI), and pure mathematics, he focuses on leading standards and best practices while helping business units deliver true value by identifying, and solving, challenges ideal for machine learning.",
            "title": "Hyperautomation – The New Era of Digital Transformation",
            "abstract": "QA Automation has always been a strategy that when successfully implemented enables organizations to improve software quality while releasing more frequently. Roughly a year ago a new concept emerged from Gartner as the leading technology trend for 2020, “Hyperautomation”. Hyperautomation is the concept of automating everything in an organization that can be automated utilizing QA Automation, Robotic Process Automation, and Machine Learning / AI. Come discover how you can digitally transform your organization enabling the fully automated enterprise.",
            "time": "9:15 - 10:15",
            "room": "Interfaith Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/andy-warns-8a512b30/",
            "twitter": "",
            "linkedin2": "https://www.linkedin.com/in/jhaning/",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        }
    ]
}
        