{
    "sessions": [
        {
            "speaker": "Rex Black",
            "shortbio": "Author & QA Architect at Epic Games",
            "bio": "With over forty years of experience, Rex Black is a QA Architect at Epic Games. He is currently working on a long-term set of initiatives to: improve consistency of test tool use and underlying data quality; build a set of test results dashboards; implement a standard, flexible approach to risk-based testing; define process metrics for the QA team; and, create and deliver e-learning courses to support these initiatives. He has completed migration to a new test management system, developed training in the new test management system, testing best practices, test automation frameworks, and risk-based testing, defined metrics and dashboards, introduced risk-based testing, delivered SDET bootcamps to develop internal automation expertise, and contributed to the creation of a games industry testing certification.\n\nIn his consulting career, Rex worked with clients from small start-ups to Fortune 20 global enterprises.  He has experience helping clients apply software and systems engineering and testing best practices in a wide variety of development lifecycles, including Kanban, Scrum, DevOps, Waterfall, and Spiral. Rex has served as an expert witness for six cases, including one $180 million breach of contract case. He was the Senior DevSecOps/QA Consultant in a Software Quality Oversight Organization overseeing a multi-year corporate integrity agreement between the US Office of Inspector General and eClinicalWorks, a major electronic health records company.\n\nRex is the most prolific author in the field of software testing.  His fourteen books have sold hundreds of thousands of copies around the world and have been translated into over a dozen languages. In addition, Rex created more than twenty training courses, which have been used to train tens of thousands of people internationally, both through RBCS training and through a worldwide network of partners. Rex presented a monthly free webinar for over ten years; this series attracted over 50,000 registrations and now is popular podcast. Rex has written over fifty articles, presented hundreds of papers, workshops, and seminars, and given about a hundred keynotes and other speeches at conferences worldwide.\n\nRex is a Founder and past President of RBCS, the ISTQB, the ASTQB, and the TMMi America chapter.",
            "title": "Reflections on 40 Years in Software Quality",
            "abstract": "I've worked in software testing and quality assurance since 1987 (having been a professional programmer since 1983). Over the years, some things have changed for the better, some things haven't changed at all, and, unfortunately, some things have changed for the worse. In this talk, you’ll get my sometimes spicy—like ghost pepper spicy—takes on these things. Agree or disagree, I hope to get you re-thinking some things you might have taken for granted.",
            "summary": "A veteran shares candid, provocative insights on decades of software testing. He'll cover what's improved, stagnated, or worsened—to challenge assumptions and spark fresh thinking.",
            "time": "4:15 - 5:15",
            "room": "East Ballroom",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/rex-black/",
            "twitter": "https://twitter.com/RBCS",
            "youtube": ""
        },
        {
            "speaker": "Tariq King",
            "shortbio": "CEO at Test IO",
            "bio": "Tariq King is a recognized thought-leader in software testing and  quality engineering. He is currently the CEO and Head of Test IO, an EPAM company. Tariq has over fifteen years' professional experience in the software industry, and has formerly held positions including VP of Product-Services, Chief Scientist, Head of Quality, Quality Engineering Director, Software Engineering Manager, and Principal Architect. He holds Ph.D. and M.S. degrees in Computer Science from Florida International University, and a B.S. in Computer Science from Florida Tech. He has published over 40 research articles in peer-reviewed IEEE and ACM journals, conferences, and workshops, and has written book chapters and technical reports for Springer, O'Reilly, IGI Global, and more. Tariq has been an international keynote speaker and trainer at leading software conferences in industry and academia, and serves on multiple conference boards and program committees.",
            "title": "Human Experience Testing: Redefining Quality in the Age of AI",
            "abstract": "Artificial Intelligence is rapidly becoming an accepted means of accelerating software engineering and testing activities.  Many organizations have already integrated AI into their software development lifecycle, and the demand for AI-assisted engineering continues to grow year over year.  A key motivating factor behind the demand is the promise of increased speed and efficiency through automation. Software testing is a prime candidate for AI acceleration due to the generally high costs and significant manual effort involved in validation and verification.  As a result, we are seeing an exponential growth in the application and development of tools to support AI-driven test automation.c\n\nBut what does the adoption of AI-driven automation mean for the future of software testing?  Is AI going to replace manual testers and/or test automation engineers? It seems like these questions are quickly growing old and repetitive because no one is providing definitive answers based on practical, real-world analysis. Join industry expert Tariq King as he takes you on a journey into the future of software testing. Tariq firmly believes that AI will take over software testing and permanently transform the quality engineering landscape. He postulates that the future of testing will be focused on evaluating human experiences, including testing digital, physical, and experiential touchpoints. In the age of AI, human experience testing will not just be viewed as a quality assurance function, but as a core component of an organization’s business strategy. Welcome to the future of quality where AI specifies, designs, codes, and tests software, leaving the humans to do the one thing the machines can’t – test the human experience.",
            "summary": "AI is transforming software testing by automating technical tasks and elevating human testers to focus on user experience as a core business strategy.",
            "time": "8:00 - 9:00",
            "room": "East Ballroom",
            "website": "https://medium.com/@tariq_king",
            "linkedin": "https://www.linkedin.com/in/tariqking",
            "twitter": "https://x.com/@tariq_king",
            "slidesLink": "",
            "speaker2": "",
            "bio2": "",
            "shortbio2": "",
            "linkedin2": "",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        },
        {
            "speaker": "Damian Synadinos",
            "shortbio": "Helping build better people",
            "bio": "For over 30 years, Damian Synadinos helped “build better software & build software better” through testing. Now, through his company Ineffable Solutions, he helps “build better people”. As a full-time, international public speaker, he delivers entertaining and educational keynotes, talks, and training that are focused on people, based on experience, and supplemented with research. He has helped organize the \"QA or the Highway\" testing conference (QAortheHighway.com), performs & teaches improv comedy, authored & illustrated a children’s book (HankAndStellaBooks.com), and draws strangers for fun (IDrawStrangers.com).",
            "title": "Trust, but Verify - explAIned",
            "abstract": "Everything starts with trust. It is the foundation of personal and professional relationships, leadership abilities, innovation, collaboration, business stability, entire nations, and much more. And often, trust is enough. However, misplaced trust—trusting the wrong thing, the wrong amount, or at the wrong time—can have significant, negative consequences.\n\nBut how can we know when trust is enough? And what do we do when it is not? By practicing skepticism!\n\nSkepticism is frequently equated with cynicism or pessimism, and skeptics are often seen as suspicious or even jaded. But, real skepticism is actually a neutral stance that suspends belief until justified evidence is available. Healthy skepticism is more closely aligned with curiosity and caution. And it can help us avoid negative consequences and move forward when trust is not enough.\n\nPracticing skepticism involves fact-checking, being aware of biases, asking good questions, and much more. And it is all especially relevant with the rise of Artificial Intelligence, a powerful yet complex technology. Understanding AI and practicing skepticism can help us use it effectively and safely.\n\nJoin me as I explore trust, promote skepticism, offer ways to develop a skeptical mindset, and show how these ideas apply to AI and other contexts by providing practical tips to better navigate our world.",
            "summary": "Learning how much - or little - to trust AI, and what to do about it.",
            "time": "9:15 - 10:15",
            "room": "Great Hall 1 & 2",
            "website": "https://www.ineffable-solutions.com/",
            "linkedin": "https://www.linkedin.com/in/damiansynadinos/",
            "twitter": "@dsynadinos",
            "youtube": "https://www.youtube.com/playlist?list=PLJEZ1QEUJI1gkC-4BUUNCeuBpBi4B59wf"
        },
        {
            "speaker": "Jess Lancaster",
            "shortbio": "Director, Engineering Quality and Compliance at TechSmith",
            "bio": "Jess Lancaster is the Director of Engineering Quality and Compliance at TechSmith, the makers of Snagit, Camtasia, and other visual communication software. He has over 25 years of software testing, software compliance, and leadership experience with government, financial, insurance, and commercial software organizations. Jess has spoken on software and testing practices at meetups, webinars, and conferences. He has also served as adjunct faculty for software testing at Lansing Community College.",
            "title": "Accessibility Testing as a Team Sport",
            "abstract": "Accessibility testing and compliance can be daunting and it often falls to testers. But it doesn't to be so challenging! Join us as we explore how TechSmith makes accessibility testing a team sport! In this session you will:\n\n- Learn about fundamentals of accessibility testing and free tools to get you started.\n- Realize how collaboration between UX designers, developers, testers, project managers, and accessibility experts can create more inclusive experiences and build a culture of accessibility in our organizations\n- Explore challenges of integrating accessibility testing into the development lifecycle and strategies for overcoming them.",
            "summary": "This session explores how accessibility testing can be a team sport, highlighting the roles and collaboration needed to integrate testing practices into the development process.",
            "time": "12:45 - 1:45",
            "room": "West Ballroom",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/jesslancaster",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "James Gould",
            "shortbio": "QA Leader, Automation Evangelist, Gamer, Board Game Enthusiast, Dog Lover.",
            "bio": "James Gould is a dedicated professional with a passion for technology and a deep appreciation for the joys of life. Beyond his career, James is an avid enthusiast of both video games and board games, finding joy in the strategic challenges and storytelling they offer. He cherishes quality time with his family, valuing the moments spent together. At home, James enjoys the companionship of his beloved dog, Billie Poppins, who adds a special touch to his daily life.",
            "title": "Why Measuring Matters",
            "abstract": "The evolution from manual testing to an automation-first strategy is essential in modern software development. However, manual testing remains invaluable for tasks requiring human intuition, creativity, and exploratory skills. This paper explores how organizations can effectively transform their QA strategy to embrace automation without losing the benefits of manual testing, particularly when faced with challenges such as increased test complexity, growing product scope, and the need for faster release cycles. By leveraging low-code solutions such as Mabl, companies can enhance efficiency, improve test coverage, and scale their operations without completely overhauling their workforce. Factorio is a strategy game that emphasizes automation and efficiency, requiring players to gradually replace manual labor with automated systems to scale production. Drawing insights from this game, this paper illustrates the balance between manual and automated processes in software testing, demonstrating how a gradual shift to automation enables teams to focus on high-value tasks while maintaining manual testing where it adds the most value.",
            "summary": "We'll dive into the importance of tracking metrics within teams and how measuring efficiency and performance can dramatically impact outcomes.",
            "time": "10:30 - 11:30",
            "room": "West Ballroom",
            "website": "",
            "linkedin": "www.linkedin.com/in/jamesgould98011",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "David Vano",
            "shortbio": "CRO at Parasoft",
            "bio": "As Parasoft's CRO, Dave drives the overall strategy, vision, and execution of all customer-facing activities worldwide. He ensures that Parasoft is a dedicated partner in helping its customers deliver high-quality solutions faster and with less risk.\n\n Dave has more than 30 years of experience in technology, starting as a Cryptologic Technician in the U.S. Navy. Prior to joining Parasoft, Dave held a variety of senior go-to-market leadership positions with Micro Focus, NetIQ Corporation, and BMC Software. Dave retired from the U.S. Navy with over 20 years of service both in active duty and as a reservist. He holds a bachelor’s degree from Excelsior College.",
            "title": "Eliminating Bottlenecks: Accelerating Development & Testing in a Complex Software Ecosystem",
            "abstract": "Modern software development demands rapid iteration, seamless integration, and continuous testing across complex distributed systems.  However, dependencies on unavailable, costly, or evolving services create bottlenecks that hinder development and delay testing cycles. Traditional approaches fail to provide the flexibility and scalability required for efficient software delivery.\n\nThis session explores a methodology that enables teams to simulate dependencies with realistic, controlled responses, allowing development and testing to proceed uninterrupted.  By reducing constraints associated with third-party APIs, legacy systems, and evolving microservices, organizations can accelerate software delivery, improve test coverage, and enhance collaboration across teams. Attendees will learn how this approach integrates into CI/CD pipelines, supports automated testing strategies, and reduces operational costs while ensuring high software quality.\n\nJoin us to discover how adopting this strategy can transform the way your teams develop, test, and deploy software, eliminating common roadblocks that slow down innovation.",
            "summary": "Learn how to remove testing constraints, accelerate development, and improve software quality by simulating dependencies in complex systems.",
            "time": "9:15 - 10:15",
            "room": "Student Alumni Room",
            "website": "https://www.parasoft.com",
            "linkedin": "https://www.linkedin.com/in/djvano/",
            "twitter": "@djvano",
            "youtube": ""
        },
        {
            "speaker": "Chris Harbert",
            "shortbio": "Founder & CEO of Testery, Host of the Developers Who Test Podcast",
            "bio": "Chris Harbert is an industry executive, international conference speaker, host of the Developers Who Test podcast, MBA, and Founder & CEO of Testery: the easiest way to scale open-source tests. His love of software test automation started nearly twenty years ago when he was a developer doing test-driven development at a company that was early to adopt Agile practices. Today he shares this knowledge and experience with others so we can ship better quality software faster and have more fun doing it.",
            "title": "The Better Quality Movement: How We Can Advocate for a Better Digital World",
            "abstract": "In an era where software shapes every corner of our lives — governing healthcare, finance, education, and even democracy — the consequences of poor-quality software extend far beyond bugs and crashes. They manifest in broken trust, systemic failures, and real-world harm. But whose responsibility is it to sound the alarm? Who will advocate for change not just within their teams, but across industries, governments, and global systems? The answer is _us_.\n\nThis talk will challenge and inspire you to think beyond your immediate role and organization to embrace a larger mission: being an advocate for quality as a societal value. Drawing upon lessons from successful community activism, we’ll explore how software development and testing professionals can raise awareness about the true cost of bad software, rally stakeholders across disciplines, and influence broader policies and standards. We have an opportunity --- and a moral obligation --- to be the voice for responsible software practices.",
            "summary": "This talk will challenge and inspire you to think beyond your immediate role and organization to embrace a larger mission: being an advocate for quality as a societal value.",
            "time": "3:05 - 4:05",
            "room": "West Ballroom",
            "website": "https://chrisharbert.com/speaking",
            "linkedin": "https://www.linkedin.com/in/christopherharbert/",
            "twitter": "https://x.com/ChrisHarbert",
            "youtube": ""
        },
        {
            "speaker": "Damián Pereira",
            "shortbio": "AI & Test Automation Leader, Speaker, and Nature Enthusiast",
            "bio": "Damian Pereira is a seasoned Software Engineer and Test Consultant with over 14 years of experience in software development, automation testing, and AI-driven test solutions. He specializes in backend and frontend automation, AI/ML applications in testing, and leading cross-functional teams to drive innovation in software quality.\n\nCurrently serving as Head of the Testing Discipline at Endava Uruguay, Damian leads a team of 50+ Test Engineers, focusing on advancing test automation strategies, integrating AI into testing workflows, and shaping the future of quality engineering. His work includes pioneering AI-powered testing tools, such as an API Automation Agent that generates test frameworks from OpenAPI specifications and an LLM-powered test generation browser extension. With expertise in agentic workflows, retrieval-augmented generation (RAG) systems, and AI-enhanced automation, he is passionate about pushing the boundaries of what’s possible in testing through artificial intelligence.\n\nBeyond his professional endeavors, Damian enjoys spending time with his family, playing soccer, and nurturing his deep love for nature. As a father of two—Amanda (8) and Juan Cruz (6)—he balances his tech-driven career with life in the countryside, where he is dedicated to growing a forest garden, cultivating trees, and fostering biodiversity.\n\nWith a unique blend of technical expertise, leadership, and a passion for sustainability, Damian brings a fresh perspective to AI in software testing, making complex automation accessible and effective for teams worldwide.",
            "title": "From Specs to Tests: Automating API Testing with AI",
            "abstract": "AI-powered automation is transforming the way teams build and maintain API testing frameworks. In this talk, we’ll explore how AI can accelerate API automation by automatically generating test suites from OpenAPI specifications and Postman collections, significantly reducing manual effort and increasing test coverage.\n\nBy attending, you’ll learn how to:\nAccelerate API Automation: Understand how AI-driven approaches can streamline the creation of test suites, minimizing repetitive tasks and improving efficiency.\n\nEnhance Testing Confidence: Explore how AI-powered automation enhances test consistency, reliability, and maintainability.\n\nValidate AI Tools Effectively: Gain insights into the challenges of testing AI-driven automation and best practices for ensuring accuracy and trustworthiness.\n\nWe’ll begin with an overview of the foundational concepts behind AI-assisted API automation, followed by a demonstration of how AI can rapidly convert API definitions into comprehensive test suites. As an example, we’ll showcase an open-source AI Agent that applies these principles, available at GitHub. Finally, we’ll discuss effective strategies for validating AI-generated tests, helping teams adopt similar approaches with confidence.\n\nJoin us to discover how AI-driven test automation can improve efficiency, expand test coverage, and help deliver more reliable software—faster.",
            "summary": "Discover how AI can automatically generate API test suites from OpenAPI specifications and Postman collections, streamlining automation and reducing manual effort.",
            "time": "9:15 - 10:15",
            "room": "Cartoon Room",
            "website": "https://github.com/damianpereira86",
            "linkedin": "https://www.linkedin.com/in/damian-pereira/",
            "twitter": "@damianpereira86",
            "youtube": ""
        },
        {
            "speaker": "Matt Eland",
            "shortbio": "Wizard at Leading EDJE",
            "bio": "An AI Specialist and Wizard at Leading EDJE who is known to teach software engineering, AI, and data science concepts in the most ridiculous ways possible. Matt has used machine learning to settle debates over whether Die Hard is a Christmas movie, reinforcement learning to drive the behavior of digital squirrels, data analytics to suggest improvements to his favorite TV show, and AI agents to play board games and create an AI agent with the personality of a dog. Matt is the author of \"Data Science in .NET with Polyglot Notebooks\" and \"Refactoring with C#\" as well as several LinkedIn Learning courses. Matt helps organize the Central Ohio .NET Developer Group, runs several blogs and a YouTube channel, has a Master’s of Science in Data Analytics, and is a current Microsoft MVP in AI and .NET.",
            "title": "Mad Data Science",
            "abstract": "If you're anything like me, you like to build fun things and have fun while doing so. In this fun talk we'll talk about the value of side projects as a tool for perpetual learning, growth, emotional health, and career development in the tech world.\n\nWe'll tour the landscape of side projects and why you might want to pick one up, how to select a side project and get started with one, how to constrain the scope of a side project and make progress against it, and how to bring side projects to their inevitable conclusion.\n\nSide projects aren't easy, though, and so we'll talk about getting unstuck, finding time for side projects, what to do when you're bored of a side project (or tempted by a new one), and ways of growing and staying healthy in those seasons of life when side projects just aren't feasible.\n\nAlong the way, you'll hear some tales of interesting, innovative, amusing, and even horrifying side projects I've taken on over the years and hear a few specific ways that side projects have impacted myself and those I've had the privilege of mentoring.",
            "summary": "Side projects as a tool for perpetual learning, growth, emotional health, and career development in the tech world.",
            "time": "1:55 - 2:55",
            "room": "West Ballroom",
            "website": "https://matteland.dev/",
            "linkedin": "https://www.linkedin.com/in/matteland/",
            "twitter": "https://x.com/IntegerMan",
            "youtube": "https://www.youtube.com/c/MattEland"
        },
        {
            "speaker": "Aaron Evans",
            "shortbio": "QA Strategy Consultant",
            "bio": "As an instinctual tester, I'm a pessimist at heart. That means I'm pleasantly surprised at least half the time.  I've been testing software for 25 years (not counting the time I left the industry screaming to live on a remote island) which is over half of my life. I suppose I should get some new hobbies or interests outside of work.",
            "title": "Chaotic Neutral: QA Roles and Alignment",
            "abstract": "QA is often seen as an outsider in the software development realm.  Testers are known for breaking things -- and complaining about what doesn't work.  Why that's a good thing -- and why it's perceived as a bad thing. How we can embrace our role of bringing chaos and become a hero in the quest to deliver quality software.\n\nI will talk about the different roles we play as testers and the different perspectives we can bring, all while comparing the quest for quality software to a fantasy roleplaying adventure game.\n\nWe will attempt to learn together:\nHow QA gets put in a silo & how to break out of that silo.\nWhy we should embrace our outsider perspective.\nAnd how to gain acceptance as a valuable part of the software development team while doing it.\n\nAttendees will also develop their own character class, choose their alignment, and decide which attributes and skills they want to develop to grow in their profession.",
            "summary": "How our role as testers (outsiders looking in) benefits the software development process — and how it can be compared to fantasy role-playing games.",
            "time": "12:45 - 1:45",
            "room": "Cartoon Room",
            "website": "https://fijiaaron.com",
            "linkedin": "https://linkedin.com/in/aaronevans",
            "twitter": "",
            "youtube": "https://www.youtube.com/oneshore"
        },
        {
            "speaker": "Vitaly Skadorva",
            "shortbio": "QA Automation Developer Specialist at Intact Financial Corporation",
            "bio": "Vitaly Skadorva is a seasoned Quality Assurance Automation Engineer with 15+ years of experience in software testing. He specializes in test automation frameworks, CI/CD practices, and mentoring upcoming QA engineers. Currently, at Intact, he has been instrumental in implementing Cypress for component testing in React and Angular projects, reducing regression times and enhancing test stability. Vitaly is well-versed in Cypress, Playwright, and Selenium and is an active industry speaker. He authored “Ultimate Web Automation Testing with Cypress,” a guide that has proven valuable resource for QA professionals looking to excel in web automation testing with Cypress.",
            "title": "Accelerate Your Testing: Implementing Shift-Left with Cypress Component Testing",
            "abstract": "Early defect detection is essential for maintaining high-quality software in today's fast-paced development environments. This session explores the concept of shifting left in testing by implementing Cypress component testing. I will share insights from my extensive experience transitioning to Cypress, focusing on how component-level testing can reduce the need for extensive end-to-end tests, thus saving time and resources. Attendees will learn the step-by-step process of setting up Cypress for component testing, the challenges faced, and the tangible benefits realized, including increased test stability and faster execution times. Key takeaways include practical strategies for integrating component testing into your CI/CD pipeline and the best practices for mentoring teams on adopting this approach.",
            "summary": "Discover how Cypress component testing enables early defect detection, improves test efficiency, and integrates seamlessly into CI/CD pipelines for faster, more reliable software delivery.",
            "time": "10:30 - 11:30",
            "room": "Student Alumni Room",
            "website": "https://vitalyskadorva.com/",
            "linkedin": "https://www.linkedin.com/in/vitalyskadorva/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "David Leslie",
            "shortbio": "QA Leader at SIS",
            "bio": "David is the QA Practice Leader at SIS where he supports clients both as a QA Manager and as a Product Manager. Before joining SIS David was the QA manager for Express where he led testing for eCommerce, Store Mobile applications, Point of Sale and Omni Channel\n\nTo give back to the community, David enjoys mentoring people new to Agile and speaking at QA events like QA or the Highway on how to improve testing on Agile teams.\n\nDavid recharges by traveling to museums, reading and volunteering with the Civil Air Patrol as an Aerospace Education Officer where he teaches young people about drones and cyber security ",
            "title": "What is Quality in 2025?",
            "abstract": "Software has never been at the same time more stable and more complex as it is now. Yet we see more people frustrated with the technology they use. So how can we help this as QA professionals? This session will talk about the different definitions of Quality and give you tips for how you can help drive your organization into a definition that bridges these differences.",
            "summary": "It's 2025 - let's look at how Quality can mean different things to your organization, users, and customers - and tips for getting them on the same definition.",
            "time": "1:55 - 2:55",
            "room": "Interfaith Room",
            "website": "https://sysintspec.com/",
            "linkedin": "https://www.linkedin.com/in/davidwleslie/",
            "twitter": "https://x.com/davidwleslie",
            "youtube": ""
        },
        {
            "speaker": "Vineela Nalla",
            "bio": "I am a Senior IT Automation Engineer at Landau and Associates, specializing in test automation for web, desktop, and API applications. With over eight years of experience in Software Quality Assurance, I have built and optimized automation frameworks using C#, Python, Java, and various testing tools such as Selenium WebDriver, PyTest, Unittest, and Postman. I have extensive experience across multiple domains, including Banking, Healthcare, Legal, Gaming, and Construction.\n\nI have successfully led teams in designing scalable test automation solutions that have reduced manual workloads and accelerated release cycles.\n\nBeyond work, I have contributed to research in deep learning and AI, with my work published in IEEE and ScienceDirect. I enjoy exploring emerging technologies, mentoring aspiring QA professionals. Outside of technology, I love to paint, read books, watch documentaries.",
            "shortbio": "Senior IT Automation Engineer | QA Strategist | Researcher | Enthusiast",
            "title": "End-to-End Test Automation: Web, Desktop, and APIs",
            "summary": "Discover how to streamline web, desktop, and API testing with a unified automation approach for maximum efficiency and reliability.",
            "abstract": "In today’s rapidly evolving software landscape, quality assurance goes beyond UI testing. A robust automation strategy must seamlessly integrate web, desktop, and API testing to ensure a flawless user experience across all platforms.\n\nThis session will explore best practices for designing scalable automation frameworks using Selenium WebDriver, PyTest, Unittest, and C# for web applications, PyAutoGUI and AutoIt for desktop automation, and Postman, SOAP UI, and Swagger for API testing. Attendees will gain insights into choosing the right tools, handling automation challenges, integrating CI/CD pipelines, and optimizing test efficiency.\n\nWhether you’re a QA professional, developer, or engineering manager, this session will equip you with the knowledge to build a comprehensive test automation strategy that enhances software quality and accelerates delivery.",
            "time": "10:30 - 11:30",
            "room": "Cartoon Room",
            "website": "",
            "linkedin": "",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Caleb Crandall",
            "bio": "Caleb has been involved in software development and testing for over 13 years. He's a champion for critical thinking and software testing as a skilled profession that still makes sense as a specialization on par with other development specialization roles.",
            "shortbio": "Software Test Lead / Scrum Master",
            "title": "Edifices of Illusion - The Impact of Certifications, Standards, and Reports on The Craft of Testing",
            "summary": "A critical look at the ISTQB software testing certifications and a couple other examples to see how reflective they are of skilled software testing in the real world.",
            "abstract": "Whether you're brand new to testing or a grizzled veteran, you're probably familiar with various certifications and standards, purportedly about software testing. The ISTQB suite of certifications. There are multiple ISO standards. There's a large enterprise company, perhaps even sponsoring this conference, that publishes an annual \"World Quality Report\". All of these are presented and backed by impressive-looking institutions and the weight of \"surely something this big and well-recognized is a reliable source of truth\". But is it? In this talk, we'll test several examples of these giant-organization-backed artifacts, just as we would test claims, and think critically, about the software we test every day. We'll examine whether the guidance and mindsets they propagate about testing hold up to professional scrutiny, or if they are indeed...edifices of illusion.",
            "time": "10:30 - 11:30",
            "room": "Interfaith Room",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/caleb-crandall/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Michal Buczko",
            "bio": "Michal is a Software Quality Manager at Carrier HVAC, where he has focus on the quality processes in project deliveries. His goals also include Quality KPIs and monitoring system design. He works with a passion for fast and efficient testing, where Michal provides valuable insights into test harness design, solutions for industrialization projects, scope definition, and efficient test reporting. Beyond his role at Carrier HVAC, Michal is dedicated to sharing his expertise with others and helping them grow both personally and professionally. He actively participates in various activities, including quality management, project consulting, and requirements analysis. Currently, he is leveraging his extensive experience as a Quality Management Consultant. In his free time, Michal enjoys pursuits such as archery, fishing, and enjoying a glass of rum.",
            "shortbio": "Software Quality Lead Engineer at Carrier HVAC",
            "title": "Leading from Anywhere: Value-Based Framework for Remote Teams",
            "summary": "A practical, value-driven framework that transforms basic remote management into creating thriving distributed teams through real-world tested methods and actionable goals.",
            "abstract": "The team leadership had a fundamental transformation with the wide adoption of remote work. While organisations have adapted their operational practices, the human aspects of leadership - building trust, fostering growth, and advocating for teams - require a reimagining in the virtual space. This presentation introduces a practical, value-based framework developed through real-world experience in leading distributed teams across multiple time zones, cultures, and organisational contexts.\n\nRemote leadership is not just managing from a distance - it's about building an environment where teams thrive despite remote separation. The framework that will be presented is focused on three foundational values, each supported by three specific, actionable goals that together is author's personal approach to remote team’s leadership excellence. Through this approach and methods leaders can extend their own practices to expand their teams to be resilient, high-performing while maintaining human connection in virtual environments. This framework can be applied as a whole or by particular methods and practices.\n\nDrawing from personal journeys containing both successes and failures in implementing different principles, this presentation based on the final author's way of leading the team offers practical insights into how leaders can move from basic remote management to create truly engaging and happy remote teams with a core role of their leadership as the foundation of the success. The framework addresses crucial aspects like building psychological safety, fostering professional growth, and ensuring team visibility - all while supporting the complexities of remote work.",
            "time": "12:45 - 1:45",
            "room": "Great Hall 1 & 2",
            "picture": "",
            "website": "https://buczkomichal.ghost.io/",
            "linkedin": "https://www.linkedin.com/in/buczkomichal/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Eric Potter",
            "bio": "Eric is the Director of Technical Education for Sweetwater and a Microsoft MVP for Visual Studio and Development Technologies. He works primarily in the .Net web platform but loves opportunities to try out other stacks. He has been developing high-quality custom software solutions since 2001. He has successfully delivered solutions for clients in a wide variety of industries. He loves to dabble in new and exciting technologies. In his spare time, he loves to tinker with Arduino projects. He fondly remembers what it was like to develop software for the Palm OS. He has an amazing wife and 5 wonderful children. He blogs at http://humbletoolsmith.com/ and you can follow him on Twitter as @pottereric.",
            "shortbio": "Director of IT Quality and Education",
            "title": "Climbing the Unclimbed Mountain: Estimation for Software Projects",
            "summary": "Use math to quickly generate an estimate and tools you can use to communicate clearly about what your estimate really means.",
            "abstract": "For many reasons, it is challenging to estimate what it will take to finish a software project. One of those reasons is that no one has ever built that project before. How do you deal with the uncertainties inherent in traveling in uncharted territory?\n\nThe first group to climb Mt. Everest had to make plans for climbing into literal uncharted territory. Their planning enabled them to succeed. In this session, we will look at what they did right in their preparation and how you can apply those lessons in your estimates for your next project. ",
            "time": "12:45 - 1:45",
            "room": "Great Hall 3",
            "picture": "",
            "website": "https://humbletoolsmith.com/",
            "linkedin": "https://www.linkedin.com/in/ericbpotter/",
            "twitter": "https://x.com/pottereric",
            "youtube": ""
        },
        {
            "speaker": "Darrin Whitley",
            "bio": "I am a husband, musician, mentor, and engineer whose life is directed by the gospel of Jesus Christ. Home for me is the DMV area (DC, Maryland, and Virginia) but my wife, Kristen, and I are currently based in the Raleigh-Durham area in North Carolina. I’m passionate about serving others through mentorship, collaboration, and cultivating safe spaces for growth. And my leadership strategy is three fold: Equipping people with knowledge and perspective, Encouraging people with truth and empathy when hard times come, and Empowering people with opportunities and resources to succeed and overcome new challenges.\n\nAfter graduating from James Madison University with a BS in Integrated Science and Technology, I began my career in the software industry as a web developer writing in ColdFusion and C#/.NET with a healthy dose of SQL. After four years, I moved to North Carolina to pursue a MA in Ministry Leadership at Southeastern Baptist Theological Seminary. During my second year, I began my search for a developer position in the area and this is when my career began to shift. I applied to a C#/.NET role and was asked questions about cloud architecture and my plan for working full time while studying part time. When they hired me, I was excited about jumping back into development. But to my surprise, they tasked me with starting their test automation effort with Java and Selenium and to train off-shore testers on the framework. This is how I got into testing!\n\nFast forward nine years, I’m now a Senior Software Test Engineer at WillowTree (a Telus Digital company) with experience building B2B and B2C solutions with diverse teams for clients in various industries including travel, food & beverage, and automotive. Throughout my fifteen year career, I’ve learned that technology is simply another context or vehicle for building relationships with people, whether they are the people on your team, the clients you’re serving, or the users you’re engaging. I’ve also learned that work is deeply personal, especially when we bring our full selves to environments where we spend time and energy that we cannot get back.\n\nHere are some fun facts about me. My wife and I enjoy watching women’s basketball both college and professional. I have a tee shirt for every airport that I’ve visited (including layovers). If you bring up Star Trek or the Nickelodeon cartoon “Hey Arnold”, you’ll be speaking my love language. I love laughing big at small things, thinking deeply about why we do the things we do, and telling and listening to personal stories.",
            "shortbio": "Senior Software Test Engineer at WillowTree (a Telus Digital Company)",
            "title": "Testing You Can Trust",
            "summary": "The core deliverable that any tester must provide is trust.",
            "abstract": "The purpose of any type of test in any context is not so that the subject can simply pass it. Ultimately, it is to provide a measure of trust. Trust relies on past performance, understands present realities, and anticipates future behavior. It is also impacted by the trustworthiness of the one who made the test. This is a deeply personal matter. As testers, our trustworthiness impacts the trustworthiness of our tests which then impacts the trustworthiness of our feature or application. In this presentation, I’ll be addressing the five elements of trust based on the book “Trust” by Dr. Henry Cloud and applying them to the world of software testing.",
            "time": "1:55 - 2:55",
            "room": "Cartoon Room",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/darrin-whitley-84b42219/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Yunhao Jiao",
            "bio": "Yunhao Jiao, a Yale University graduate with a master’s degree. He has nearly five years of experience at AWS, where he served as a Senior Software Engineer. During his time at Amazon, he played a crucial role in building the Contract Tests framework for AWS CloudFormation, ensuring that resource types operated as expected throughout their lifecycle. Since 2015, Yunhao has been actively involved in NLP research, publishing his first AI paper as the lead author in 2017. He also contributed to education as the Chinese High School Artificial Intelligence Textbook editor. After his tenure at Amazon, Yunhao founded TestSprite and participates in the Techstars and YC China accelerator programs.",
            "shortbio": "Founder and CEO of TestSprite",
            "title": "Using AI Agents To Test GenAI Software",
            "summary": "Autonomous AI testing agents will transform GenAI-driven development by extending capabilities of QA, and ensuring greater confidence in AI-generated code.",
            "abstract": "As Generative AI reshapes software development, ensuring the quality and reliability of GenAI-generated code presents significant challenges for development teams — especially those with limited resources. Traditional testing workflows often fall short in identifying subtle bugs, maintaining compliance, and addressing corner cases in complex codebases. This session explores how autonomous AI testing agents have evolved beyond co-pilot assistance to full autopilot capabilities, enabling seamless, end-to-end quality assurance with minimal human intervention.\n\nWhat Attendees Will Learn:\n* The differences between AI co-pilot and autopilot testing solutions and their impact on testing workflows.\n* Practical steps to integrate autonomous AI testing tools into DevOps pipelines with minimal disruption.\n* Strategies for achieving robust code integrity in GenAI-driven environments while addressing common challenges like missed corner cases and compliance risks.\n* Key metrics and KPIs for evaluating the success of AI-powered testing solutions in resource-limited teams.",
            "time": "12:45 - 1:45",
            "room": "Student Alumni Room",
            "picture": "",
            "website": "https://testsprite.com",
            "linkedin": "https://www.linkedin.com/in/yunhaojiao/",
            "twitter": "https://x.com/yunhaojiao",
            "youtube": ""
        },
        {
            "speaker": "Nate Custer",
            "bio": "Having worked as a Systems Architect, QA Automation Lead, Application Developer, Developer of Tools and Testing Harnesses for QA teams, and as Principal Consultant with TTC Global for Fortune 500 organizations – Nate is passionate about helping teams deliver quality software. When he is not at a computer, you’ll most likely find him reading a book of philosophy, sipping scotch, or talking with his friends about Manchester United.",
            "shortbio": "Principal Consultant at TTC Global",
            "title": "Testing AI? Build a Benchmark",
            "summary": "Learn how to test AI systems effectively with custom benchmarks and practical testing strategies.",
            "abstract": "Companies are increasingly building applications which leverage AI. Testing systems built on AI is a pressing concern. In this talk we will explore strategies for testing systems built on AI, explain why building a custom benchmark should be part of your plan, and walk through the scoping and technical process of building a benchmark.\n\nKey Take Away: the goal for this talk is that listeners walk away equipped to have conversations about how testing can play a critical role as companies build AI based features and excided about this new area of testing.",
            "time": "12:45 - 1:45",
            "room": "Interfaith Room",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/nate-custer-a2a02210/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Jeff Van Fleet",
            "bio": "Co-author of The Coach and the Geek: Building a Kick Butt Culture. After spending over 20 years managing, developing, and deploying complex software/hardware systems for both commercial and Department of Defense (DoD) applications, Jeff founded Lighthouse in 2000 with the aim of establishing a company whose customer service was only eclipsed by the quality of its work. Armed with an encyclopedic knowledge of motivational leadership tactics and a wealth of expertise in software quality assurance (QA) processes and technical leadership, he’s both a hands-on company leader and the primary architect of Lighthouse’s celebrated workplace culture. When not at work, Jeff loves spending time with his family, baking bread, cheering for Penn State, and hiking.",
            "shortbio": "President & CEO | Lighthouse Technologies",
            "title": "Focus on What Matters Most: How to Improve Software Quality AND Work-Life Balance",
            "summary": "Rescue runaway projects with a 5-step framework to deliver faster, reduce defects, and restore morale.",
            "abstract": "Imagine being five years into a software project that was only supposed to take two. You're constantly stuck in crunch mode and under pressure, overwhelmed by unexpected defects,missed deadlines, and escalating costs. Your team is burned out, morale is low, and every dayfeels like firefighting. If this sounds familiar, you’re not alone.\n\nIn this engaging and pragmatic session, we’ll share the story of one company that found itself inthis exact situation—a software project that was years behind schedule and millions overbudget, with no end in sight. The key to turning things around?\n\nThey committed to a proven 5-step process that enabled them to focus on what matters most.The company started by using five key performance indicators to gain visibility into their currentstate. With those insights, they then identified root causes, prioritized the most critical fixes, andmade data-driven improvements. By creating a culture of continuous measurement andfeedback, they shifted from chaos to control. The outcome: faster delivery, fewer defects, and ahealthier, more sustainable work environment. The team could finally breathe again—withoutsacrificing nights and weekends.\n\nAt the end of this session, you’ll walk away with practical tools, actionable insights, and a clearpath to improving your own software delivery process, so you too can focus on what mattersmost—both at work AND home.\n\nHere’s the 5-step approach we’ll cover:\n1. Understand the core principles of effective software development\n2. Measure where you are today\n3. Identify the root causes of your challenges\n4. Fix the most critical issues first\n5. Continuously measure, learn, and improve\n\nJoin us to discover how these steps can help you deliver better software faster—while reducing stress, improving team morale, and achieving a better work-life balance.",
            "time": "10:30 - 11:30",
            "room": "Great Hall 3",
            "picture": "",
            "website": "https://lighthousetechnologies.com/",
            "linkedin": "https://www.linkedin.com/in/jeff-van-fleet-381ba4/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Igor Dorovskikh",
            "bio": "Igor Dorovskikh is a seasoned technology leader, entrepreneur, and expert in software quality engineering with over 15 years of experience building world-class test automation teams and solutions for leading enterprises and startups. His career spans top tech companies, including Apple, Grammarly, Tinder, and more, where he has mastered optimizing CI pipelines for mobile UI testing.\n\nCurrently, Igor is the CEO of Marathon Labs (North America) and Engenious.io, where he drives innovation in mobile test automation and helps companies build scalable AI-driven testing solutions. His leadership has positioned Marathon Labs as a go-to solution for optimizing mobile test execution at scale, reducing test cycle times from hours to minutes.\n\nBeyond business, Igor is actively involved in the testing community, frequently speaking at global conferences like STARWEST, TestCon, and Automation Guild, where he shares insights on AI in testing, scalable automation, and mobile CI/CD best practices.\n\nWith a passion for mentorship and innovation, Igor continues to shape the future of software quality assurance by integrating AI, automation, and strategic testing frameworks into modern development pipelines.",
            "shortbio": "Ex-Tinder | CEO at Marathon Labs | Driving AI-Powered Test Automation & Scalable QA Solutions for Enterprises & Startups",
            "title": "Building a Scalable Infrastructure for Mobile UI Test Execution",
            "summary": "Learn how to future-proof your mobile UI test automation by building a scalable, high-performance infrastructure that eliminates bottlenecks, speeds up execution, and seamlessly integrates with CI/CD—leveraging orchestration tools, cloud-native solutions, and in-house optimizations to handle thousands of tests efficiently.",
            "abstract": "In an era of rapid mobile development cycles, maintaining reliable, efficient, and scalable UI test automation is a critical challenge for engineering teams. With thousands of test cases running across multiple devices, emulators, and cloud environments, traditional test execution strategies fail to scale, leading to slow feedback loops, high maintenance costs, and infrastructure bottlenecks.\n\nThis session explores cutting-edge strategies for building a scalable UI test execution infrastructure, leveraging orchestration tools, cloud-native solutions, and in-house hardware optimizations. We will dive into:\n- Optimizing test execution pipelines to reduce flakiness and speed up results\n- Scaling tests across cloud and in-house servers for cost-effective automation\n- Utilizing Kubernetes, Docker, and virtualized environments for parallel execution\n- Handling real vs. mock network dependencies in large-scale mobile UI testing\n- Ensuring CI/CD integration with tools like Marathon, Flank, and Xcodebuild\n\nWith real-world insights from large-scale test automation implementations, this talk provides practical solutions for QA leaders, automation engineers, and DevOps teams looking to future-proof their mobile test strategies. Whether you’re running tests for a startup or a global enterprise, this session will equip you with the knowledge to build a robust, scalable, and high-performing UI test infrastructure.\n\nJoin us to learn how to eliminate bottlenecks, reduce test execution time, and take your mobile test automation to the next level!",
            "time": "1:55 - 2:55",
            "room": "Great Hall 1 & 2",
            "picture": "",
            "website": "https://marathonlabs.io/",
            "linkedin": "https://www.linkedin.com/in/igordorovskikh/",
            "twitter": "",
            "youtube": "https://www.youtube.com/@DevHacks360",
            "speaker2": "Tagir Fakhriev",
            "bio2": "Tagir Fakhriev is a Senior Android Engineer on the Developer Experience (Dev XP) team, with 10 years of experience in the tech industry. Passionate about testing, tooling, continuous integration, and developer productivity, Tagir focuses on streamlining workflows that enhance development efficiency. With expertise in CI/CD pipelines, test automation, and infrastructure for mobile teams, Tagir enjoys solving complex engineering challenges to create seamless development experiences",
            "shortbio2": "Senior Android Engineer",
            "linkedin2": "",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        },
        {
            "speaker": "Roger Durham",
            "shortbio": "QA practitioner and programmer",
            "bio": "After a long career in software and QA, ranging from Sun Microsystems Laboratories (as Roger Hayes) to start-ups, large companies, and consulting, I retired in 2020, built a kayak, and then unretired in 2023 to work with an old friend, providing QA services to purchasers of software and systems. I have published on QA practices, automation, and performance testing, and am interested in applying the best current theory to practical problems.",
            "title": "QA on the Highway",
            "abstract": "The challenges of QA for vehicle dashboards, and for control panel systems in general. Most vehicles nowadays have software-driven dashboards. This brings great flexibility, and a considerable challenge for QA. The vehicle’s user interface may include several screens, interface to many separate vehicle control units (engine, safety, infotainment, etc.), communicate over many data channels (GPS, Bluetooth, CAN bus, mobile data), and may cooperate with phone apps and internet services. Defining the correct boundary for test systems and emulating, simulating, or controlling all the interfaces of the system is an interesting challenge.",
            "summary": "The challenges of QA for vehicle dashboards and control panel systems.",
            "time": "1:55 - 2:55",
            "room": "Student Alumni Room",
            "website": "https://www.mcanta.com",
            "linkedin": "https://www.linkedin.com/in/rogerlhayes/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Dan Belcher",
            "bio": "Dan has spent his career building products to make life easier for software teams. He is a co-founder at mabl, which provides a test automation product that uses AI to help teams deliver better software faster. Prior to mabl, Dan worked on the Cloud Platform team at Google, which he joined through its acquisition of Stackdriver, a company that he also-co-founded. Dan spent his early career in product and technical leadership roles at VMware, Sonian, and Microsoft. He lives in Boston with his wife and three children and enjoys golf, travel, and pickleball.",
            "shortbio": "Co-founder, product & engineering leader at mabl",
            "title": "Testing the Unpredictable: Ensuring Quality in GenAI-Powered Applications",
            "summary": "How we can rise to meet the new quality challenges presented by GenAI-powered applications",
            "abstract": "While AI-driven test automation has been widely discussed, the challenges of testing Generative AI applications are relatively new to most teams. Traditional QA methods struggle to address the dynamic and non-deterministic nature of AI-generated output. How do we define \"correct\" behavior for AI-powered features like chatbots, content generation, and recommendation engines, and how do we evaluate that in an automated way? What types of regressions are most likely to occur, and how do we detect them?\n\nIn this session, we will explore practical approaches to testing GenAI applications, from evaluating response consistency and accuracy to mitigating biases and unexpected failures. We’ll also discuss how the role of QA is shifting in an AI-driven landscape and what skills and strategies testers need to stay ahead. Attendees will leave with actionable insights to confidently tackle the quality challenges of this new AI era.",
            "time": "9:15 - 10:15",
            "room": "Great Hall 3",
            "picture": "",
            "website": "https://www.mabl.com/",
            "linkedin": "https://www.linkedin.com/in/dbelcher/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Ervan Rodgers",
            "bio": "Ervan Rodgers is the former Senior Vice President and Chief Information Officer at Designer Brands. Rodgers is a seasoned executive with more than 25 years of experience in IT disciplines as well as supply chain, digital, cybersecurity, business process, program, and operations management.\n\nPrior to joining the company in 2021, Rodgers was Chief Information Officer for the State of Ohio where he was responsible for managing a $2 billion budget across all agencies as well as the strategic direction and efficient use of information technology across state government. During this time, he also served a dual role as Assistant Director of the Ohio Department of Administrative Services.\n\nRodgers’ background also includes a role as the Ohio Attorney General Office’s Chief Information Officer and Chief Information Security Officer and IT consulting for global Fortune 100 companies including Huntington National Bank, Accenture, and Hewlett-Packard, where he developed a successful track record of leading teams and leveraging technology to position for growth. This private sector work provided valuable hands-on experience that honed his expertise in digitizing core business processes, EBusiness, developing value-added solutions, change management, and mentoring management teams.\n\nA passionate community advocate, he currently serves on the board of directors for National Church Residences, an organization dedicated to advancing better living for all senior citizens Also on the board of directors for The Center for Healthy Families, an organization focused on building bridges to brighter futures for young families. Rodgers earned a Bachelor of Arts in management and organizational development from Spring Arbor University in Michigan and a Master of Science in computer science from Muskingum University.\n\nRodgers has received numerous local and national awards, including recently receiving the Ohio Enterprise ORBIE for organizations with $1.6 billion to $5 billion annual revenue and Top Ten Retail CIO 2023.",
            "shortbio": "Chief Information Officer | Board Member | Community Leader",
            "title": "\"Quality Engineering\" The Lens of a CIO",
            "summary": "Learn how modern CIOs view Quality Engineering as a strategic driver of speed, trust, and resilience.",
            "abstract": "As digital transformation accelerates, Quality Engineering (QE) has become a cornerstone of enterprise success—impacting everything from speed to market to digital trust. Yet too often, QE is still seen as a tactical function rather than a strategic enabler.\n\nIn this session, we’re joined by Ervan Rodgers, a two-time CIO with deep experience leading large-scale technology transformations. Ervan will share how forward-thinking CIOs view QE as critical to business resilience—powered by automation, performance engineering, and data integrity.\n\nHe’ll also explore how AI is beginning to transform QE, from intelligent test creation to predictive defect detection—helping teams move faster while ensuring quality at scale.\n\nWhether you’re writing tests or leading a QE organization, this session will help you connect your work to the bigger picture—and understand the strategic impact of modern Quality Engineering.",
            "time": "9:15 - 10:15",
            "room": "West Ballroom",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/ervanrodgers/",
            "twitter": "",
            "youtube": "",
            "speaker2": "Tony Haislar",
            "bio2": "Where business meets technology — that's where you'll find Tony Haislar. With 20+ years of experience leading enterprise IT, Tony has helped some of the world’s largest organizations turn Quality Engineering into a true business accelerator.\n\nAs VP of Strategic Accounts at Narwal, Tony partners with clients to unlock the full potential of AI, Data, Automation, and QE — transforming delivery models, improving digital trust, and driving faster, smarter business outcomes. His deep expertise bridges both technical and executive conversations, making him a trusted advisor to technology leaders navigating the complex world of digital transformation.",
            "shortbio2": "Vice President of Strategic Accounts | Narwal",
            "linkedin2": "https://www.linkedin.com/in/tonyhaislar/",
            "twitter2": "https://x.com/narwalinc",
            "website2": "https://narwal.ai/",
            "youtube2": "https://www.youtube.com/channel/UCGsr-Z-dtXoQgkoFTDku_SQ"
        },
        {
            "speaker": "Tony Richards",
            "bio": "Tony Richards is a seasoned sales professional with extensive experience in account management and field sales. Currently serving as a Strategic Account Manager at Tricentis since August 2022, Tony previously worked at Micro Focus as a Field Sales Executive, where responsibilities included engaging with Fortune 100 C-Level decision makers to enhance DevOps implementations. Prior roles include Sales Executive at Exact, where focus was on ERP solutions for mid-sized manufacturers, and Account Executive at Dell, concentrating on SharePoint services in the New England and Eastern Canada regions. Additional experience spans various sales positions at Quest Software, AT&T Mobility, and Clear Channel Radio. Tony holds a degree from The Ohio State University, completed in 2007.",
            "shortbio": "Field Account Manager, Tricentis",
            "title": "What the evolution of AI means for your Agile testing practice",
            "summary": "How QA teams can harness the power of LLMs and AI tools to boost efficiency.",
            "abstract": "Generative AI is more than a buzzword. Its most common form today is in the Large Language Models (LLMs) family. This hugely complex algorithm containing hundreds of billions of parameters can digest the information it consumes and return a granular, structured product that might’ve otherwise taken hours or even days to create manually. Developers are already taking advantage of AI tools such as Copilot to work more efficiently – and there’s no reason QA can’t do the same! Learn more in this session.",
            "time": "1:55 - 2:55",
            "room": "Great Hall 3",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/tonyrichardstesting/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Brian Hamilton",
            "bio": "Brian Hamilton is an accomplished Software Engineering leader with extensive experience in QA/QE, test automation, Data Validation, and engineering management in everything from VC-backed Start Ups to Federal Contracting. Brian specializes in building high-performing QA/QE and Dev teams, driving process improvements, and championing best practices in a high-speed SDLC. He is passionate about empowering both Software Engineering professionals and managers to collaborate effectively, foster continuous learning, and deliver exceptional product quality. Brian is a frequent speaker at industry conferences, including \"QA or the Highway,\" where he shares actionable insights on leadership, team development, and innovative Quality Engineering strategies.",
            "shortbio": "Engineering Manager | Agile Practitioner | Start Up Veteran | AI Enthusiast | Quality and Product Evangelist",
            "title": "Driving Impactful 1:1 Meetings: Empowering QA/QE Professionals and their Managers for growth.",
            "summary": "Unlock the full potential of 1:1s to boost growth, clarity, and collaboration in QA/QE teams.",
            "abstract": "One-on-one meetings are a cornerstone of effective team management, yet their true potential is often untapped, especially within Software Quality Assurance/Quality Engineering (QA/QE) teams. This session explores how QA/QE professionals can proactively shape their 1:1 meetings to foster growth, clarity, and collaboration, while also equipping managers/supervisors with actionable strategies to lead these conversations for maximum impact.",
            "time": "3:05 - 4:05",
            "room": "Cartoon Room",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/brianhamilton1/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Bob Fornal",
            "bio": "My focus is on front-end development: JavaScript, CSS, SVG, AngularJS and Angular, React, and Ionic. I commonly speak about Quality Engineering, Best Practices, and Front-End Technologies. \"Learning from my mistakes over the decades, I feel that I have become a solid programmer.\" -- Me",
            "shortbio": "Senior Developer with a passion for learning, testing, mentoring, speaking and personal growth.",
            "title": "Gherkin: Friend or Foe? Re-Evaluating Its Role in Modern Development",
            "summary": "Gherkin simplifies specs for all, but misusing it can sabotage your automated testing efforts.",
            "abstract": "Gherkin is a domain-specific language used to define test cases in a human-readable format, primarily for behavior-driven development (BDD). It allows stakeholders, including non-technical team members, to understand and contribute to software specifications. Gherkin uses keywords like \"Feature\", \"Scenario\", \"Given\", \"When\", \"Then\", \"And\", and \"But\" to structure test scenarios.\n\nGherkin is probably sabotaging your development process. I've seen it used well ... I've seen it used badly. Let's talk about situations where it can cause significant problem when building automated test cases and how to use it properly.",
            "time": "3:05 - 4:05",
            "room": "Student Alumni Room",
            "picture": "",
            "website": "https://code-squid.com",
            "linkedin": "https://www.linkedin.com/in/rfornal/",
            "twitter": "https://twitter.com/rfornal",
            "youtube": "https://www.youtube.com/@bob-fornal"
        },
        {
            "speaker": "Stuart Minchington",
            "bio": "Stuart is a seasoned technology leader with over two decades of experience spanning technical services, DevOps, and strategic account management. With a deep understanding of automation, infrastructure management, and QA innovation, Stuart is a trusted partner in technical discussions, helping businesses navigate complex challenges with clarity and efficiency. Passionate about solving customer pain points, Stuart focuses on delivering practical solutions tailored to business needs rather than advocating for any particular tech stack, language, or framework. His approach is rooted in flexibility and adaptability, ensuring organizations can leverage the right tools to achieve their objectives.",
            "shortbio": "Sr. Director of Solution Engineering",
            "title": "Unlocking the Power of Test Orchestration with HyperExecute",
            "summary": "Revolutionize test execution with HyperExecute: faster feedback, lower CI/CD costs, and actionable analytics.",
            "abstract": "In today’s fast-paced software development landscape, optimizing test execution is critical to maintaining speed, reliability, and cost efficiency. HyperExecute, LambdaTest’s cutting-edge Test Orchestration platform, is designed to streamline the testing lifecycle, reduce CI/CD costs, and provide deeper insights into test data. This session will explore how TestOps can revolutionize the way organizations manage automated testing, ensuring faster feedback loops, better resource utilization, and actionable analytics. Whether you’re scaling your test infrastructure or looking to enhance visibility into test execution, HyperExecute offers a high-performance solution tailored to modern testing challenges.",
            "time": "3:05 - 4:05",
            "room": "Great Hall 1 & 2",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/stumin/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Bob Crews",
            "bio": "Bob Crews, CEO / Founder of Checkpoint Technologies, is an entrepreneur, consultant, and trainer with 37 years of IT experience in full life-cycle development, quality assurance, and software testing with a focus on functional and performance testing. He has assisted organizations such as Harvard University, the FBI, J.P. Morgan Chase, Great American Insurance Company, Wal-Mart, the U.S. Air Force, and the Department of Veterans Affairs in developing teams, processes, and solutions to improve the quality of their applications. Bob has spoken at conferences and universities on the topics of IoT (Internet of Things), how AI is impacting the software testing world, functional test automation, and risk analysis. He is exceptionally enthusiastic about the future of IT, software testing, and AI’s place in it.",
            "shortbio": "CEO / Founder of Checkpoint Technologies",
            "title": "Testing Challenges of B.U.C.K.E.Y.E.D. – A Self-Driving AI Bus System",
            "summary": "Experience AI’s impact on QA through a hands-on simulation tackling six core testing challenges in real time.",
            "abstract": "AI isn’t just shaking up Quality Assurance and Software Testing—it’s tearing down the walls between technology and business and rebuilding them in real time! Whether you’re a hands-on developer, a manual or automation test engineer, a test lead, manager, executive, or owner, AI’s disruptive power hits you differently. Now more than ever, we’re charged not just with delivering innovation, but with safeguarding the lifeblood of the enterprise—because one slip in quality can ripple through an entire organization. In this high-energy, fully immersive exercise, you’ll dive into a gripping, fictitious AI project alongside an IT Executive Board, dissecting the six core testing challenge categories and learning how to conquer them from day one. Buckle up—your mission starts now!\n\nThe Mission: YOU, the attendees, will be participating as members of the Checkpoint Technologies Executive IT Team. We have been awarded a prestigious contract by Imaginary Corporation to test their state-of-the-art, fully autonomous self-driving bus system B.U.C.K.E.Y.E.D. (Bus Using Cognitive Knowledge, Engineered to Yield Efficient Driving), developed for the state of Ohio The AI system is a strong AI, meaning it has a higher level of autonomous reasoning, learning, and adaptability than traditional narrow AI systems. This makes testing uniquely complex and high-stake.\n\nLed and moderated by Bob Crews, CEO of Checkpoint Technologies, we must identify and provide Imaginary Corp. with a categorized list of our primary testing challenges. Your goal is to ensure project success, minimize and mitigate risk, and protect Checkpoint Technologies and Imaginary Corporation (from potential liabilities arising from negligence). Additional details and guidance will be provided at the beginning of our “meeting”.",
            "time": "9:15 - 10:15",
            "room": "Interfaith Room",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/bob-crews-checkpointech/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Parasar Saha",
            "bio": "Parasar Saha is the CEO and Co-Founder of Digy4, the AI-powered Quality Engineering platform behind DigyDashboard, which consolidates disparate testing data into a single, actionable view. Over his 23-year career at Air Canada, Scotiabank and SOTI, he architected enterprise testing frameworks still in use today and filled the gaps that slow large-scale software delivery. As a founding member of the Canadian Quality and Testing Association (CQTA), Parasar has elevated QE strategy into C-suite boardrooms nationwide. He now leads a team of enterprise, AI and DevOps veterans in building DigyDashboard, DigyAI and DigyKube—bringing “human-level” intelligence to every stage of the software lifecycle.",
            "shortbio": "CEO and Co-Founder of Digy4",
            "title": "Enterprise Reporting: Elevating Quality Visibility to the C-Suite",
            "summary": "AI-powered platform unifies fragmented QA tools into real-time, boardroom-ready quality insights for Agile enterprises.",
            "abstract": "In today’s Agile enterprises, Quality Engineering is hampered by a fragmented tool ecosystem—Jira, multiple test management platforms, diverse test frameworks, ServiceNow and more—while the effort required to build and maintain a scalable, cloud-based reporting infrastructure in-house can divert precious engineering resources and delay time-to-value. The strategic approach overcomes both obstacles by deploying lightweight, ground-level connectors that extract raw events and metrics from every tool, streaming them into a centralized, cloud-native data store where they are normalized and persisted at scale. A composite metrics engine then transforms this ground-level data into standardized Engineering KPIs, aligns them with Business OKRs, and computes unified “quality scores” across all Agile pods. Finally, an AI-driven continuous monitoring and optimization platform detects gaps, anomalies and risk patterns in real time, automates root-cause analysis by correlating failures with code changes and environment shifts, and recommends targeted process or resource adjustments. The result is a turnkey, data-driven blueprint that bypasses homegrown toil, enforces metric consistency, continuously optimizes performance through AI, and delivers boardroom-ready insights that elevate quality to a C-Suite priority.\n\nThis approach helps bring quality to the C-Suite table in real time, satisfying executives’ demand for immediate, data-driven visibility.",
            "time": "3:05 - 4:05",
            "room": "Great Hall 3",
            "picture": "",
            "website": "https://digy4.com/",
            "linkedin": "https://www.linkedin.com/in/parasarsaha/",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "Ganesh Mahalingam",
            "bio": "Ganesh is a seasoned product leader with a deep passion for solving real-world problems faced by developers and testers. At BrowserStack, he has built flagship products for Cross Browser Testing, Real Device Testing, and Accessibility Testing, which are used by over 5 million people to test and ship quality software with confidence. Having worked with thousands of QA teams over the last decade, Ganesh brings a unique blend of technical insight and user empathy to everything he builds. He lives in New Jersey with his wife and enjoys reading and travelling, always looking for new stories and perspectives.",
            "shortbio": "Director of Product at BrowserStack",
            "title": "Beyond the Hype & Into Action: Accelerating Quality with AI Agents and Unified Test Stack",
            "summary": "Turning AI hype into real testing value. See how top teams boost coverage, cut failures, and scale quality.",
            "abstract": "While AI continues to dominate the conversation, most testing teams are still grappling with how to turn the hype into real, practical value. That’s the top concern we’ve heard from across our 50,000+ customers.\n\nOver the past two years, we’ve worked closely with thousands of them to solve the actual problems of AI adoption. The result? A 10x boost in productivity, a 50% jump in coverage, and a 40% reduction in build failures  —all through practical, targeted applications of AI where it matters most.\n\nIn this session, I’ll walk you through how leading teams at companies like GM, PayPal, and L’Oréal are using AI agents and BrowserStack’s Unified Test Stack to drive measurable results. You’ll see live demos across key use cases—like instant test generation, intelligent test selection, visual testing, and low-code automation—plus real benchmarks comparing AI-driven workflows with manual efforts and generic LLMs like ChatGPT.\n\nIf you’re a QA leader, developer, or tester looking to deliver quality at scale, this session will give you a clear, practical view into what’s working—and how to stay ahead as testing enters the AI era.",
            "time": "10:30 - 11:30",
            "room": "Great Hall 1 & 2",
            "picture": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/ganeshrammahalingam/",
            "twitter": "",
            "youtube": "",
            "speaker2": "Kenton Self",
            "bio2": "Kenton Self is a seasoned technology leader and Senior Customer Engineer at BrowserStack, where he partners with teams across domains to advance their test automation strategies with a focus on scalability, reliability, and AI integration. With nearly three decades of experience in software engineering, Kenton has deepened his expertise in artificial intelligence in recent years, applying it to complex challenges at the intersection of AI, testing, and automation.\n\nRespected for both his technical depth and strategic insight, Kenton serves as a trusted advisor to engineering leaders driving digital transformation. Based in Dallas, Texas, he enjoys exploring new places, playing the guitar, and learning Spanish in his free time.",
            "shortbio2": "Senior Customer Engineer at BrowserStack",
            "linkedin2": "https://www.linkedin.com/in/kentonself/",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        }
    ],
    "potential": [
        {
            "speaker": "",
            "bio": "",
            "shortbio": "",
            "title": "",
            "summary": "",
            "abstract": "",
            "time": "4:15 - 5:15",
            "room": "East Ballroom",
            "picture": "",
            "website": "",
            "linkedin": "",
            "twitter": "",
            "youtube": ""
        },
        {
            "speaker": "",
            "bio": "",
            "shortbio": "",
            "title": "",
            "summary": "",
            "abstract": "",
            "time": "",
            "room": "",
            "picture": "",
            "website": "",
            "linkedin": "",
            "twitter": "",
            "youtube": "",
            "speaker2": "",
            "bio2": "",
            "shortbio2": "",
            "linkedin2": "",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        }
    ]
}